using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
namespace Pract_2_Iwanov
{
    internal class Questions
    {
        1. Интерфейс, когда код выполняется только при наступлении какого-либо события (Допустим, нажатия Кнопки)..
        2. Тем, что Контент в Текстовом поле пользователь может сменить напрямую, а в Метке лишь через Код..
        3. Для нажатия на Кнопку.. Нужно соответственно для такого элемента, как 'Кнопка'..
        4. Событие смены текста в Поле.. Для Текст Бокса.. Полезно для смены Контента в поле, по нажатию Кнопки..
        5. Свойство Content.. Только обратиться нужно будет к уже существущему Контенту (тексту) в поле Tex_Box'а (ReplicateLebel.Content = name.Text();)
        6. Написать в событии Кнопки Код: nameButton.Content = "Текст"; (Т.е изменить свойство Content)
        7. Чем раньше в строке Кода XAML стоит то или иное Событие, тем раньше оно Инициализируется..
        8. Цвет Элемента станет Тускнее, т.к изначально он находится на значении 100 (Где 100 - виден полностью, 0 - полностью прозрачный)..
        9. Добавить в свойства Текстового Поля, строку: name.Text = "Text\r\nText";
        10. Поменять свойство Visibility (C Visibility.Visible на Visibility.Hidden;)
        11. Элемент управления Ellipse (Только цвет менять уже не Background'ом, а Fill'ом)..
        12. Просто менять Цвет Background'а других Цветов Светофора - на Белый, когда загорается, допустим - Красный..
        13. В Свойствах выбранного Элемента / Кисть - там выбрать нужный Цвет (Если нужно чтобы это что-то изначально было другого Цвета)..
        14. nameButton.Content = "Текст";

⦁	Что такое событийно-ориентированный интерфейс? +
⦁	Чем отличаются текстовое поле и метка? +
⦁	Что означает событие Click? Для какого элемента управления оно может быть? +
⦁	Что означает событие TextChanged? Для какого элемента управления оно может быть? +
⦁	Какое свойство метки нужно изменить, чтобы поменять ее текст? +
⦁	Какое свойство кнопки нужно изменить, чтобы поменять текст на ней? +
⦁	Как влияет на компоненты порядок их следования в коде разметки XAML? +
⦁	Что будет, если свойство Opacity установить в 50? +
⦁	Как разместить в текстовом поле текст в две строчки? 
⦁	Как реализовать исчезновение кнопки после ее нажатия? +
⦁	Какой элемент управления можно использовать, чтобы сделать сигналы светофора круглыми? 
⦁	Как сделать так, чтобы горел только один сигнал светофора? +
⦁	Как поменять цвет объекта? +
⦁	Обработчик какого события надо было написать, чтобы поменялась надпись на кнопке? +

    }
}
*/